using System;

namespace Самостоятельная_Работа_6_2
{ /* Напишите программу с классом, у которого есть два символьных поля и метод. 
   * Он не возвращает результат и у него нет аргументов.
При вызове метод выводит в консольное окно все символы из кодовой таблицы, 
    которые находятся “между” символами, являющимися значениями полей объекта 
    (из которого вызывается метод).
Например, если полям объекта присвоены значения ‘A’ , ‘D’, то при вызове метода в 
    консольное окно должны выводиться все символы от ‘A’ до ‘D’ включительно.
   */
    class MyClass
    {
        public char symbol01;
        public char symbol02;
        public void getSymbolsBetween()
        {

        }
    }
    class Program
    {
        static void Main()
        {
        }
    }
}