a = (5 + 2) ** 2 - 3 * 2    # Результат 43
b = 6 - 5 / 2               # Результат 3.5
c = 10 // 4 + 10 % 3        # Результат 3
print("Результаты вычислений: ")  # Результаты вычислений выводим на экран
print(a, b, c)

print(bin(18))  # Двоичный формат
print(hex(24548))  # 16-ричный формат
print(oct(358))  # 8-ричный формат
print(max(3, 4, 8, 9, 14, 1, -5, 18, 0, 2))
print(min(3, 4, 8, 9, 14, 1, -5, 18, 0, 2))
print(oct(pow(2,10)))  # Возведение в степень и конв-я в 8-ричный формат
import math
print(round(math.pi, 2))
