using System;

namespace Самостоятельная_Работа_6_9
{ /* Напишите программу с классом,  в котором есть статические методы, которым можно 
   * передавать произвольное количество целочисленных аргументов (или целочисленный массив). 
   * Методы, на основании переданных аргументов или массива, позволяют вычислить: 
   * наибольшее значение, наименьшее значение, а также среднее значение из набора чисел. */
    class MyClass
    {

    }
    class Program
    {
        static void Main()
        {
        }
    }
}