using System;

namespace Самостоятельная_Работа_6_8
{ /* Напишите программу с классом,  в котором есть закрытое статическое 
   * целочисленное поле с начальным нулевым значением. 
В классе должен быть описан статический метод, при вызове которого отображается 
текущее значение статического поля, после чего значение поля увеличивается на единицу.*/
    class MyClass
    {
        private int number;
        public void show()
        {

        }
    }
    class Program
    {
        static void Main()
        {
        }
    }
}